[
{"url": "https://www.abc.ca.gov/la-quinta-sports-bar-receives-revocation-for-furnishing-alcohol-to-minors/", "title": null, "date": null, "content": "– The Department of Alcoholic Beverage Control (ABC) has revoked the license of Beer Hunter Sports Bar & Grill in La Quinta after employees furnished alcohol to two minors who were obviously intoxicated, resulting in great bodily injury on January 24, 2024. One minor backed into a parked vehicle. The minor exited the vehicle and entered the roadway, where they were struck by an oncoming car, sustaining great bodily injury. Under the agreement, the license is revoked, with the revocation stayed for the next 180 days to allow for transfer of the license. In addition, the license is suspended indefinitely until it is transferred. ABC opened a   investigation immediately after the crash to determine the source of the alcohol the underage driver consumed. ABC agents determined that two on-duty bartenders furnished the alcoholic beverages to two minors without conducting any ID checks. “Keeping alcohol out of the hands of minors is one of our top priorities,” said ABC Acting Director Frank Robles. “We’re reminding businesses and their employees to check IDs carefully and do their part to keep Californians safe.” ABC sought disciplinary action against the Beer Hunter Sports Bar & Grill’s alcoholic beverage license for furnishing alcoholic beverages to a minor causing great bodily injury or death, sale of alcoholic beverages to a minor, service of alcohol to someone who was obviously intoxicated, and other business-related violations. The TRACE program is made possible by a grant from the California Office of Traffic Safety (OTS) through the National Highway Traffic Safety Administration (NHTSA). The grant provides funding for ABC investigations of alcohol-related incidents that involve a person under the age of 21 causing great bodily injury or death, or anyone charged with vehicular manslaughter that was under the influence of alcohol regardless of their age. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The Department of Alcoholic Beverage Control (ABC) has revoked the license of Beer Hunter Sports Bar & Grill in La Quinta after employees furnished alcohol to two minors who were obviously intoxicated, resulting in great bodily injury on January 24, 2024. One minor backed into a parked vehicle. The minor exited the vehicle and entered the roadway, where they were struck by an oncoming car, sustaining great bodily injury.", "scraped_at": "2025-07-20T20:22:33.154286"},
{"url": "https://www.abc.ca.gov/abc-advocates-for-a-safe-and-responsible-july-4-weekend/", "title": null, "date": null, "content": "– The California Department of Alcoholic Beverage Control (ABC) encourages the public to celebrate Independence Day weekend responsibly by designating a sober driver for celebrations involving alcohol. Licensees can help keep the public safe by checking IDs and not serving obviously intoxicated patrons. “If you’re impaired—do not drive. Plan for a safe and sober ride before you go out,” said ABC Chief Deputy Director Frank Robles. “ABC agents will be working to keep communities safe as well, ensuring licensees check IDs and don’t overserve patrons.” ABC suggests licensees offer nonalcoholic drinks for designated sober drivers and monitor who is drinking alcohol. If you see people leaving who have been drinking alcohol, check on how they are getting home and offer alternate transportation if needed. The California Highway Patrol (CHP) will deploy extra patrol officers over the holiday weekend as part of a Maximum Enforcement Period (MEP) beginning at 6:01 p.m. on Thursday, July 3, continuing through 11:59 p.m. on Sunday, July 6. There were 68 people killed in crashes on California’s roadways during the 2023 Independence Day MEP, and CHP made 1,224 arrests for driving under the influence of alcohol or drugs. According to the National Highway Traffic Safety Administration (NHTSA), about 37 people die in the United States every day from drunk-driving crashes. In 2022, 13,524 people died in alcohol-impaired driving traffic deaths. ABC’s Independence Day enforcement efforts are funded by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration. Remember to report drunk drivers by calling 911. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The California Department of Alcoholic Beverage Control (ABC) encourages the public to celebrate Independence Day weekend responsibly by designating a sober driver for celebrations involving alcohol. Licensees can help keep the public safe by checking IDs and not serving obviously intoxicated patrons.", "scraped_at": "2025-07-20T20:22:34.585746"},
{"url": "https://www.abc.ca.gov/california-alcohol-servers-approach-recertification-deadline/", "title": null, "date": null, "content": "Online recertification is an easy, three-step process – The California Department of Alcoholic Beverage Control’s (ABC) Responsible Beverage Service (RBS) program is encouraging those who initially signed up for the start of the program in the summer of 2022 to recertify by August 31, 2025 in order to stay up to date with state regulations. You must be within 90 days of your expiration date to recertify. , signed into law in 2017, created the Responsible Beverage Service Training Program Act with the intention of reducing alcohol-related harm to local communities. The bill required ABC to create a program to ensure on-premises servers of alcoholic beverages and their managers are educated on the risks of serving alcohol and related responsible practices. As of July 1, more than 600,000,322 alcohol servers and managers are trained and certified in responsible beverage service within California. RBS certification lasts three years. RBS training is legally required for servers and managers of establishments with on-sale ABC licenses, which account for approximately 56,000 ABC-licensed businesses. If you’re a server, get certified in the  , which has the tools you need to ensure compliance with the mandatory RBS training requirements. To renew your certification, you must pay your recertification fee, take training from an authorized RBS Training Provider, and pass the ABC Alcohol Server Certification exam within 30 days of your confirmed training. Log in to your RBS Server account and click   from the Renewal Notice. Once your payment is complete, return to your Server dashboard to search for a training provider. If you are a new alcohol server, have not yet obtained certification or are looking to recertify, please visit  . Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The California Department of Alcoholic Beverage Control’s (ABC) Responsible Beverage Service (RBS) program is encouraging those who initially signed up for the start of the program in the summer of 2022 to recertify by August 31, 2025 in order to stay up to date with state regulations. You must be within 90 days of your expiration date to recertify.", "scraped_at": "2025-07-20T20:22:36.122209"},
{"url": "https://www.abc.ca.gov/abc-announces-2025-26-app-grant-recipients/", "title": null, "date": null, "content": "Selected California law enforcement agencies will receive funding to help combat alcohol-related crime – The California Department of Alcoholic Beverage Control (ABC) announced that it is awarding nearly $3 million for the 2025-26 fiscal year to 47 local law agencies to assist their fight against alcohol-related crime in California. ABC will administer grants to local police and sheriff’s departments through its Alcohol Policing Partnership Program (APP). The APP Program was created in 1995 to strengthen partnerships between ABC and local law enforcement agencies in order to address problem businesses, keep alcohol away from minors, and bring penalties such as fines, suspensions or revocations against businesses that violate the law. The funds will be used to reduce the number of alcohol sales to minors, obviously intoxicated patrons, and other alcohol-related crime that negatively impact communities. “Too many young people are killed in alcohol-related incidents every year,” said ABC Acting Director Frank Robles. “If we can limit youth access to alcohol, and prevent service to obviously intoxicated patrons, then we can save lives and strengthen communities.” The APP Program has distributed more than $72 million to local law enforcement to combat alcohol-related crime since it was created 30 years ago. ABC protects communities through education, and by administering prevention and enforcement programs designed to increase compliance with California’s alcoholic beverage laws. The local law enforcement agencies who have been selected by ABC to receive grant funding are as follows: Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The California Department of Alcoholic Beverage Control (ABC) announced that it is awarding nearly $3 million for the 2025-26 fiscal year to 47 local law agencies to assist their fight against alcohol-related crime in California.", "scraped_at": "2025-07-20T20:22:37.447484"},
{"url": "https://www.abc.ca.gov/abc-statement-on-identification-requests-within-abc-licensed-locations/", "title": null, "date": null, "content": "ABC agents will always identify themselves as law enforcement and show their credentials – The Department of Alcoholic Beverage Control (ABC) is responsible for law enforcement at ABC-licensed locations, and agents in plainclothes routinely work to investigate complaints including sale of alcohol to underage individuals. Given the sale and consumption of alcohol is limited to people over the age of 21, ABC agents will ask individuals to show identification for the sole purpose of age verification to ensure licensees are complying with state law. ABC agents will clearly state they are law enforcement with ABC and will show their credentials identifying themselves. ABC is aware there is active federal immigration enforcement happening in communities across the state – as a reminder – ABC does not work with federal immigration enforcement or conduct immigration enforcement. If you have any questions, visit   page. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The Department of Alcoholic Beverage Control (ABC) is responsible for law enforcement at ABC-licensed locations, and agents in plainclothes routinely work to investigate complaints including sale of alcohol to underage individuals. Given the sale and consumption of alcohol is limited to people over the age of 21, ABC agents will ask individuals to show identification for the sole purpose of age verification to ensure licensees are complying with state law. ABC agents will clearly state they are law enforcement with ABC and will show their credentials identifying themselves. ABC is aware there is active federal immigration enforcement happening in communities across the state – as a reminder – ABC does not work with federal immigration enforcement or conduct immigration enforcement.", "scraped_at": "2025-07-20T20:22:38.920244"},
{"url": "https://www.abc.ca.gov/abc-partners-with-law-enforcement-to-prevent-underage-drinking-at-california-music-festivals/", "title": null, "date": null, "content": "– The Department of Alcoholic Beverage Control (ABC) recently conducted operations at several popular California music festivals in an effort help licensees stay in compliance and reduce youth access to alcohol. Venues and festivals interested in selling alcohol must be licensed by ABC. The department collaborates with local law enforcement to ensure licensed premises are safe and operating in accordance with the law. “ABC strives to create a safe environment at these festivals by preventing underage drinking, which can lead to serious public safety risks,” said ABC Acting Director Frank Robles. “ABC is grateful to work in cooperation with local law enforcement agencies to keep festival attendees safe.”  Agents from ABC’s Southern Division enforcement team worked the Coachella and Stagecoach Festivals over three consecutive weekends in April at the Empire Polo Club in Indio. Daily attendance peaked at nearly 110,000 for Coachella and close to 82,000 for Stagecoach, making public safety a top priority. ABC ended up deploying 30-35 agents each weekend, partnering with over a dozen other local, state, and federal law enforcement agencies for both Coachella and Stagecoach.  ABC agents from the Northern Division assisted with alcohol enforcement at the BottleRock Napa Valley music festival at the Napa Valley Expo, which attracted 119,000 attendees over Memorial Day Weekend. Earlier in May, ABC agents also worked the Country in the Park Festival in Sacramento. In total, ABC agents made 465 arrests during these popular music festival operations for violations including narcotics possession and sales, possession of false ID’s, and minors in possession of alcoholic beverages.    The most common violations ABC finds during special event operations include minors in possession of alcohol, minors in possession of fraudulent/false identification, adults furnishing alcohol to minors, and vendors illegally selling alcohol without a license. ABC agents patrolling these events often cite individuals caught committing these violations. Illegal alcohol sales pose a public safety concern, as many do not check ID, and potentially take away business from ABC licensees who are operating in accordance with the law. The department also encourages licensees to prevent driving under the influence and check identifications closely to prevent underage drinking.  Underage drinking has numerous negative effects and is the main contributing factor in vehicle collisions for persons between the ages of 16 to 20. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The Department of Alcoholic Beverage Control (ABC) recently conducted operations at several popular California music festivals in an effort help licensees stay in compliance and reduce youth access to alcohol.", "scraped_at": "2025-07-20T20:22:40.335381"},
{"url": "https://www.abc.ca.gov/abc-encourages-the-public-to-celebrate-memorial-day-safely/", "title": null, "date": null, "content": "– The Department of Alcoholic Beverage Control (ABC) is encouraging those who plan to celebrate Memorial Day weekend with alcohol to designate a sober driver or utilize a rideshare/taxi service before participating in any celebrations. The department is also asking ABC licensed establishments to be careful to not over-serve patrons. “Reducing the number of drunk drivers on the road and making sure ABC-licensed businesses check IDs carefully and don’t overserve patrons is our No. 1 safety priority this weekend,” said ABC Chief Deputy Director Frank Robles. “ABC agents will be out working in communities to help increase public safety.” Memorial Day is when we honor all the military service members who made the ultimate sacrifice defending our country. The weekend is also a time when many people graduate from high school and college, and it marks the unofficial start to the summer vacation season. Memorial Day enforcement efforts are funded by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration. Remember to report drunk drivers by calling 911. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The Department of Alcoholic Beverage Control (ABC) is encouraging those who plan to celebrate Memorial Day weekend with alcohol to designate a sober driver or utilize a rideshare/taxi service before participating in any celebrations. The department is also asking ABC licensed establishments to be careful to not over-serve patrons.", "scraped_at": "2025-07-20T20:22:41.760687"},
{"url": "https://www.abc.ca.gov/abc-encourages-teen-sobriety-and-heightened-awareness-of-combatting-youth-access-to-alcohol-this-prom-season/", "title": null, "date": null, "content": "– This prom season, the Department of Alcoholic Beverage Control (ABC) is asking teens, parents, licensees and the general public to help combat teen drunk driving and do their part to prevent youth access to alcohol. According to the National Highway Traffic Safety Administration, car crashes are the leading cause of death for teenagers, and almost one-third of those crashes involved alcohol. According to a 2022 survey by AAA on prom safety: Impaired driving poses a grave danger to everyone—and is especially deadly for young, inexperienced drivers. ABC asks parents and guardians to make plans to get their teens home safe from prom celebrations and talk to their teens about the dangers of impaired driving. Licensees can also play a pivotal role in preventing youth access to alcohol by always carefully checking IDs, denying service if they suspect or know an ID is fake, and staying vigilant of teenagers attempting to shoulder tap near their places of business. Additionally, adults should always say no to youth who solicit them to buy alcohol. The penalty for furnishing alcohol to a minor is a minimum $1,000 fine, 24 hours of community service and possible jail time. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– This prom season, the Department of Alcoholic Beverage Control (ABC) is asking teens, parents, licensees and the general public to help combat teen drunk driving and do their part to prevent youth access to alcohol.", "scraped_at": "2025-07-20T20:22:43.163773"},
{"url": "https://www.abc.ca.gov/abc-commemorates-peace-officers-memorial-day/", "title": null, "date": null, "content": "– The Department of Alcoholic Beverage Control (ABC) today commemorates Peace Officers Memorial Day, recognizing the courage and dedication of law enforcement officers around the country who have died or been disabled in the line of duty. “Peace Officers Memorial Day is a powerful reminder of the risks faced daily by our dedicated officers,” said ABC Chief Deputy Director Frank Robles. “We reaffirm our commitment to upholding their legacy through integrity, accountability, and public service.” Each year on May 15, Peace Officers Memorial Day provides an opportunity the public to reflect on the critical role peace officers play in protecting our communities. ABC joins law enforcement agencies across the state in honoring those who gave their lives in service, and in support of their families and fellow officers. ABC’s sworn agents work statewide to uphold public safety, enforce alcohol-related laws, and support communities through education and outreach. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "– The Department of Alcoholic Beverage Control (ABC) today commemorates Peace Officers Memorial Day, recognizing the courage and dedication of law enforcement officers around the country who have died or been disabled in the line of duty.", "scraped_at": "2025-07-20T20:22:44.520542"},
{"url": "https://www.abc.ca.gov/california-businesses-in-near-universal-compliance-with-prohibition-of-intoxicating-hemp-products/", "title": null, "date": null, "content": "Governor Gavin Newsom announced  on May 8 that businesses statewide continue to follow the state’s rules that prohibit the sale of hemp products that contain intoxicating cannabinoids. So far in 2025, the Department of Alcoholic Beverage Control (ABC) has seen 99.7% compliance among business licensees this year. Since September 2024, ABC agents have visited 11,445 businesses and removed 7,151 illegal products from shelves at 148 locations. On September 6, 2024, Governor Newsom announced   to protect Californians, especially youth, from the adverse health effects of dangerous hemp products. “We are doing our part to ensure intoxicating hemp products are out of the reach of vulnerable groups like children. We must always put the safety of Californians first.” -Governor Gavin Newsom Adopted by the California Department of Public Health (CDPH), the emergency regulations prohibit the marketing, offering for sale, or selling of industrial hemp food, beverages, and dietary products that contain THC or other intoxicating cannabinoids. “Our licensees have overwhelmingly complied with the regulation,” said ABC Chief Deputy Director Frank Robles. “On the few occasions when ABC agents found items during inspections, they’ve ensured these harmful products are removed from shelves.” The regulations also ban sales to people under 21. Businesses that fail to follow the law face various consequences, including criminal penalties and loss of license. ABC will continue to visit licensed locations throughout the state to enforce the new regulations and ensure illegal products are not being sold.  In October, a court   to stop enforcement of California’s emergency regulations banning THC-containing hemp products that harm the public, especially children.  California became the first state to allow medicinal cannabis use when voters passed the Compassionate Use Act in 1996, and then in 2016, voters legalized the recreational use of cannabis. California’s cannabis regulatory framework requires that businesses operate safely, that products are labeled and tested to protect consumers from contaminants, and that children are prevented from accessing cannabis products. Hemp manufacturers have been exploiting the law to produce and market hemp products that contain THC without the safeguards in place for similar cannabis products. Intoxicating hemp products have been made available at major and small retailers and marketed for their intoxicating THC properties. These regulations ban these sales. State regulators, including ABC, CDPH, the Department of Cannabis Control, the California Department of Tax and Fee Administration, and state and local law enforcement officials, enforce these requirements. Additional information may be obtained by contacting: 3927 Lennane Drive, Suite 100 Sacramento, CA 95834 Email:  Phone: (916) 419-2525 Follow ABC on  Follow ABC on  Law Enforcement Reporting Off-Sale Licensee Training", "first_paragraph": "Governor Gavin Newsom announced  on May 8 that businesses statewide continue to follow the state’s rules that prohibit the sale of hemp products that contain intoxicating cannabinoids.", "scraped_at": "2025-07-20T20:22:45.844568"}
]